import React from "react";

export default function About() {
  const services = [
    {
      title: "أعمال التشطيبات",
      desc: "تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبنلثها هاقلمستل جحسيلثها هاقلمستل جحسينب سثبننب سثبن ياتس تيب يزتب سحي",
      image: "/logo.jpg",
    },
    {
      title: "أعمال التشطيبات",
      desc: "تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبنلثها هاقلمستل جحسيلثها هاقلمستل جحسينب سثبننب سثبن ياتس تيب يزتب سحي",
      image: "/logo.jpg",
    },
    {
      title: "أعمال التشطيبات",
      desc: "تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبنلثها هاقلمستل جحسيلثها هاقلمستل جحسينب سثبننب سثبن ياتس تيب يزتب سحي",
      image: "/logo.jpg",
    },
    {
      title: "أعمال التشطيبات",
      desc: "تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبنلثها هاقلمستل جحسيلثها هاقلمستل جحسينب سثبننب سثبن ياتس تيب يزتب سحي",
      image: "/logo.jpg",
    },

    {
      title: "أعمال التشطيبات",
      desc: "تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبنلثها هاقلمستل جحسيلثها هاقلمستل جحسينب سثبننب سثبن ياتس تيب يزتب سحي",
      image: "/logo.jpg",
    },
    {
      title: "أعمال التشطيبات",
      desc: "تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبنلثها هاقلمستل جحسيلثها هاقلمستل جحسينب سثبننب سثبن ياتس تيب يزتب سحي",
      image: "/logo.jpg",
    },
  ];

  return (
    <div
      className="max-w-[1400px] w-[90vw] h-fit my-0 mx-auto mb-10"
      id="about_us"
    >
      {/* heading */}
      <h1 className="text-2xl mb-5 text-white">تعرف علينا أكثر</h1>
      {/* About As */}
      <div className="w-full grid gap-4 grid-cols-1 grid-rows-2  md:grid-cols-2 md:grid-rows-1 ">
        <div className="h-fit text-amber-500 md:my-5">
          تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبن بةيكبتصثهب
          يزتب سحيب تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبن
          بةيكبتصثهب يزتب سحيب تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل
          جحسينب سثبن بةيكبتصثهب يزتب سحيب تييتبايتايتاىستياتس تيالياهل
          اهثايلثها هاقلمستل جحسينب سثبن بةيكبتصثهب يزتب سحيب
        </div>
        <div className="h-fit text-amber-500 md:my-5">
          تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبن بةيكبتصثهب
          يزتب سحيب تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل جحسينب سثبن
          بةيكبتصثهب يزتب سحيب تييتبايتايتاىستياتس تيالياهل اهثايلثها هاقلمستل
          جحسينب سثبن بةيكبتصثهب يزتب سحيب تييتبايتايتاىستياتس تيالياهل
          اهثايلثها هاقلمستل جحسينب سثبن بةيكبتصثهب يزتب سحيب
        </div>
      </div>
      {/* Services */}
      <div className="grid gap-4 grid-cols-1 grid-rows-6 md:grid-cols-2 md:grid-rows-3">
        {services.map((service) => (
          <div className="flex mt-5">
            <div className="w-[65%]">
              <h1 className="text-white">{service.title}</h1>
              <p className="mt-5 text-amber-500">{service.desc}</p>
            </div>
            <img src={service.image} alt="" className="w-[33%] h-[200px]" />
          </div>
        ))}
      </div>
    </div>
  );
}
